Saturday-Vinyl/saturday-vinyl-supabase/s3-master/sdkconfig.defaults
# Saturday Vinyl Hub - ESP32-S3 Master SDK Configuration
# This is the master MCU handling WiFi, BLE, RFID, USB, and H2 management.

# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# Project configuration
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash configuration (8MB flash for S3 with OTA support)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# =============================================================================
# Compiler Optimization
# =============================================================================
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# =============================================================================
# FreeRTOS Configuration
# =============================================================================
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048

# =============================================================================
# Task Stack Sizes
# =============================================================================
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024

# =============================================================================
# Logging
# =============================================================================
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# =============================================================================
# Wi-Fi Configuration
# =============================================================================
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=24

# =============================================================================
# Networking (LwIP)
# =============================================================================
CONFIG_LWIP_LOCAL_HOSTNAME="saturday-hub"
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y

# =============================================================================
# HTTP/HTTPS Client
# =============================================================================
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y

# =============================================================================
# TLS Certificate Bundle for HTTPS
# =============================================================================
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# =============================================================================
# Bluetooth (NimBLE for BLE Provisioning)
# =============================================================================
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="Saturday Hub"
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=32

# =============================================================================
# USB Configuration (for Service Mode and esp-serial-flasher)
# =============================================================================
# ESP32-S3 has native USB support
CONFIG_USB_OTG_SUPPORTED=y

# Serial console configuration for bidirectional USB Serial JTAG communication
#
# We use CONFIG_ESP_CONSOLE_NONE for the primary console to prevent the VFS layer
# from taking ownership of USB Serial JTAG stdin. This allows serial_prov.c to use
# usb_serial_jtag_read_bytes() directly for receiving commands.
#
# We use CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG to route ESP_LOG output
# to USB Serial JTAG. This uses ROM printf functions that write directly to the
# hardware FIFO, which doesn't conflict with our RX driver usage.
#
# This split configuration allows:
# 1. ESP_LOG output via USB Serial JTAG (secondary console)
# 2. usb_serial_jtag_read_bytes() for receiving commands (no VFS conflict)
# 3. usb_serial_jtag_write_bytes() for sending JSON responses
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# =============================================================================
# UART Configuration
# =============================================================================
# UART1: RFID Module (YRM100)
# UART2: H2 Communication
CONFIG_UART_ISR_IN_IRAM=y

# =============================================================================
# NVS Storage
# =============================================================================
# NVS encryption (optional, enable for production)
# CONFIG_NVS_ENCRYPTION=y

# =============================================================================
# Watchdog
# =============================================================================
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# =============================================================================
# Power Management
# =============================================================================
CONFIG_PM_ENABLE=n

# =============================================================================
# VFS Configuration (for non-blocking stdin)
# =============================================================================
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_SELECT=y

# =============================================================================
# Bootloader Configuration
# =============================================================================
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y

# =============================================================================
# HTTPS OTA Configuration
# =============================================================================
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# =============================================================================
# System Event Task Stack (increased for complex operations)
# =============================================================================
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
